Tekla Open API Reference for Tekla Structures 2025
GridSurface Constructor (String)
 Creates a new grid surface instance taking the label as input.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GridSurface(
	string label
)
Public Sub New (
	label As String
)
Parameters
label
Type: System.String
The label for the grid surface.
See Also
Reference
GridSurface Class
GridSurface Overload
Tekla.Structures.Model Namespace